data = open('output_variants_test.txt', 'r')
output = open('output_all.txt', 'x')
# буквы 'ъ', 'ш' вырезаны, т. к. точно не присутствуют в расшифровке; буквы 'ё' в морзянке нет
morze = ['.-', '-...', '.--', '--.', '-..', '.', '...-', '--..', '..', '.---', '-.-', '.-..', '--', '-.', '---', '.--.',
         '.-.', '...', '-', '..-', '..-.', '....', '-.-.', '---.', '--.-', '-.--', '-..-', '..-..', '..--', '.-.-']
alphabet = ['а', 'б', 'в', 'г', 'д', 'е', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф',
            'х', 'ц', 'ч', 'щ', 'ы', 'ь', 'э', 'ю', 'я']
all_variants = []
for q in data:
    variant = ''
    phrase = '--....-.--...---.-..--..-....---'
    k = [int(i[0]) for i in q[1:-1].split()]
    for x in k:
        variant += alphabet[morze.index(phrase[:x])]
        phrase = phrase[x:]
    print(variant, file=output)
data.close()
output.close()
