morze = ['.-', '-...', '.--', '--.', '-..', '.', '...-', '--..', '..', '.---', '-.-', '.-..', '--', '-.', '---', '.--.',
         '.-.', '...', '-', '..-', '..-.', '....', '-.-.', '---.', '--.-', '-.--', '-..-', '..-..', '..--', '.-.-']
alphabet = ['а', 'б', 'в', 'г', 'д', 'е', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф',
            'х', 'ц', 'ч', 'щ', 'ы', 'ь', 'э', 'ю', 'я']
data = ['мест', 'меже', 'межа', 'межв', 'межп', 'мифт', 'мифм', 'мифг', 'мифз', 'гиен']
phrase = '--....-.--...---.-..--..-....---'
for i in data:
    x = sum([len(morze[alphabet.index(o)]) for o in i])
    for q in range(1, 5):
        print(i, alphabet[morze.index(phrase[x:x + q])])
